app/controllers/admins_controller.rb

  def login
    @user_session = UserSession.new(params[:user_session])
    if  @user_session.save && !@user_session.user.blank? && @user_session.user.role.name == 'admin'
      flash[:notice] = "Login successful!"
      session[:current_user_privileges] = []
      session[:current_user_privileges] =  @user_session.user.role.privileges.collect{|single| single.id} if !@user_session.user.role.blank? && !@user_session.user.role.privileges.blank?
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE (LOWER(`users`.login) = 'admin') LIMIT 1
SELECT `privileges`.* FROM `privileges` INNER JOIN `privileges_roles` ON `privileges`.`id` = `privileges_roles`.`privilege_id` WHERE `privileges_roles`.`role_id` = 1