app/controllers/user_sessions_controller.rb

SELECT `users`.* FROM `users` WHERE (LOWER(`users`.login) = 'admin') LIMIT 1
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save
      flash[:notice] = "Login successful!"
      session[:current_user_privileges] = []
      session[:current_user_privileges] =  @user_session.user.role.privileges.collect{|single| single.id} if !@user_session.user.role.blank? && !@user_session.user.role.privileges.blank?