app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `failed_login_count`, `last_login_at`, `last_login_ip`, `last_request_at`, `login`, `login_count`, `password_salt`, `persistence_token`, `role_id`, `updated_at`) VALUES ('2013-04-27 12:12:21', 'ef9c551bdb1431c6bf0e5034a0f19e14337774537b057e1810818d7e54055d912827a9e27ed28160be0a4da72fe47ed8cf1ed1c95d2cb2734049e66014d78239', '2013-04-27 12:12:21', '127.0.0.1', 'admin@ziparama.com', 0, NULL, NULL, '2013-04-27 12:12:21', 'admin', 1, 'kXT15ZxmpfN97yN6doY', 'b72f01464545dd0bedb7086a22c7757a8b17c2c15d3124e1cc14028becdab13e966966ef4e2af78f7298e8ea3082e86a2ae69977544bd08c56f4d9b47467c1c7', NULL, '2013-04-27 12:12:21')
---
  def create
   # render :text=> "<pre>"+params.to_yaml and return
    @user = User.new(params[:user])

    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the User has not yet been activated
    if @user.save

UPDATE `users` SET `last_request_at` = '2013-04-27 14:26:35', `updated_at` = '2013-04-27 14:26:35' WHERE `users`.`id` = 1
---
  def update
    @user = current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])