app/controllers/welcome_controller.rb

SELECT `locations`.* FROM `locations` WHERE (category_id IS NOT NULL)
SELECT `locations`.* FROM `locations` WHERE `locations`.`user_id` = 1 AND (category_id IS NOT NULL)
SELECT `categories`.* FROM `categories` WHERE `categories`.`parent_category_id` = 94
---
  def index
    @single_facebook_location = Location.find(params[:pin_id]) if !params[:pin_id].blank?
    if !params[:id].blank?
      @locations = Location.where(:category_id=> params[:id])
    else
      @locations = Location.where("category_id IS NOT NULL")
    end
    @locations = @locations.where(:user_id=> current_user.id) if params[:my_pin] == 'true' && !current_user.blank?
    @categories = Category.where("parent_category_id is NULL")

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1
---
  def page_content
    @page = Page.find(params[:id])