app/views/categories/index.html.erb

SELECT `categories`.* FROM `categories`
---
        <td align="left"  valign="middle" nowrap="nowrap" class="heading6"><%= category.name %></td>
        <td align="left"  valign="middle" nowrap="nowrap" class="heading6"><%= category.parent_category.name if !category.parent_category.blank?%></td>